#ЛЯМБДА - ФУНКЦИИ

#=====================================================================================#

#1)
#обычные функции

def f(x):
    return x ** 2
print(f(5)) #ОТВЕТ: 25


#А теперь lambda - функции

# ЗАПОМНИТЬ!!!!!
#lambda арг1, арг2, арг3,..... : выражение 

#ФУНКЦИИ НЕОБХОДИМО ПРИСВОИТЬ КАКОЕ - НИБУДЬ ИМЯ


def f(x):
    return x ** 2

r = lambda x: x ** 2

print(r(5))  #ОТВЕТ: 25
  



#2)  
# обычная функция 
def perimetr(a,b,c):
     return a+b+c

#lambda - функция
per = lambda a,b,c : a + b + c
print(per(2,5,3)) #ОТВЕТ: 10




#3)
#ПРОВЕРКА ЧИСЕЛ 

 # обычная функция
def f(x):
    if x>0:
        return 'positive'
    else:
        return 'negative'
    
print(f(5)) #ОТВЕТ: positive
print(f(-5)) #ОТВЕТ: negative



#lambda - ФУНКЦИЯ

t = lambda x: 'positive' if x>0 else 'negative'
print(t(5)) #ОТВЕТ: positive
print(t(-5)) #ОТВЕТ: negative




#4)
a = [5,554,54,323,69,87,666,31,3,4,5,6,34,656]
a.sort() #sort() = сортирует числа по возрастанию
print(a)  #ОТВЕТ: [3, 4, 5, 5, 6, 31, 34, 54, 69, 87, 323, 554, 656, 666]




#ПО КАКИМ КРИТЕРИЯМ МЫ ХОТИМ ИХ ОТСАРТИРОВАТЬ

# обычная функция
def f(x):
    return x%10 #сортировка по последней цифре

a = [5,554,54,323,69,87,666,31,3,4,5,6,34,656]
a.sort(key = f) 
print(a)  #ОТВЕТ: [31, 323, 3, 554, 54, 4, 34, 5, 5, 666, 6, 656, 87, 69]



#lambda - ФУНКЦИЯ
a = [5,554,54,323,69,87,666,31,3,4,5,6,34,656]
a.sort(key = lambda x: x % 10) #сортировка по последней цифре
print(a)  #ОТВЕТ: [31, 323, 3, 554, 54, 4, 34, 5, 5, 666, 6, 656, 87, 69]


#lambda - ФУНКЦИЯ
a = [5,554,54,323,69,87,666,31,3,4,5,6,34,656]
a.sort(key = lambda x: x //10 % 10) #сортровка по предпоследней цифре
print(a)  #ОТВЕТ: [5, 3, 4, 5, 6, 323, 31, 34, 554, 54, 656, 69, 666, 87]




#5)
#ЛИНЕЙНАЯ ФУНКЦИЯ 

# y = k * x - b формула в математике
#где k и b коэффиценты

#lambda - ФУНКЦИЯ
def linear(k,b):
    return lambda x: x * k + b

#с помощью этой функции мы можем создавать несколько линейных графиков
graf1 = linear(2, 5)
print(graf1(3)) #ОТВЕТ: 11

graf2 = linear(-4, 1)
print(graf2(5)) #ОТВЕТ: 19
